In [2]:
import pandas as pd
import numpy as np
import io

In [3]:
data = {
"0":{"Rno":111111,"Name":"John","Maths":56,"Science":64,"English":69},
"1":{"Rno":111112,"Name":"Jane","Maths":16,"Science":24,"English":22},
"2":{"Rno":111113,"Name":"Sarah","Maths":76,"Science":52,"English":3},
"3":{"Rno":111114,"Name":"Frank","Maths":75,"Science":83,"English":80},
"4":{"Rno":111115,"Name":"Mike","Maths":56,"Science":9,"English":100},
"5":{"Rno":111116,"Name":"Jennifer","Maths":73,"Science":65,"English":74},
"6":{"Rno":111117,"Name":"Jessica","Maths":16,"Science":30,"English":77},
"7":{"Rno":111118,"Name":"Fred","Maths":15,"Science":64,"English":22},
"8":{"Rno":111119,"Name":"Bob","Maths":37,"Science":36,"English":99},
}
columns = ("Rno","Name","Maths","Science","English")

df = pd.DataFrame(data=data).T

In [4]:
print(df)

      Rno      Name Maths Science English
0  111111      John    56      64      69
1  111112      Jane    16      24      22
2  111113     Sarah    76      52       3
3  111114     Frank    75      83      80
4  111115      Mike    56       9     100
5  111116  Jennifer    73      65      74
6  111117   Jessica    16      30      77
7  111118      Fred    15      64      22
8  111119       Bob    37      36      99

In [4]:
print(df.head())

      Rno   Name Maths Science English
0  111111   John    56      64      69
1  111112   Jane    16      24      22
2  111113  Sarah    76      52       3
3  111114  Frank    75      83      80
4  111115   Mike    56       9     100

In [5]:
print(df.tail())

      Rno      Name Maths Science English
4  111115      Mike    56       9     100
5  111116  Jennifer    73      65      74
6  111117   Jessica    16      30      77
7  111118      Fred    15      64      22
8  111119       Bob    37      36      99

In [6]:
print(df.head(7))

      Rno      Name Maths Science English
0  111111      John    56      64      69
1  111112      Jane    16      24      22
2  111113     Sarah    76      52       3
3  111114     Frank    75      83      80
4  111115      Mike    56       9     100
5  111116  Jennifer    73      65      74
6  111117   Jessica    16      30      77

In [7]:
df.ndim   # no. of dimensions

2

In [8]:
df.shape # no. of rows and columns

(9, 5)

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rno      9 non-null      object
 1   Name     9 non-null      object
 2   Maths    9 non-null      object
 3   Science  9 non-null      object
 4   English  9 non-null      object
dtypes: object(5)
memory usage: 432.0+ bytes

In [10]:
df.nunique() # no. of unique values in each column

Rno        9
Name       9
Maths      7
Science    8
English    8
dtype: int64

In [12]:
# Statistical description

In [11]:
df.describe()

           Rno  Name  Maths  Science  English
count        9     9      9        9        9
unique       9     9      7        8        8
top     111111  John     56       64       22
freq         1     1      2        2        2

In [13]:
df.describe(include=[object])

           Rno  Name  Maths  Science  English
count        9     9      9        9        9
unique       9     9      7        8        8
top     111111  John     56       64       22
freq         1     1      2        2        2

In [14]:
df.describe(include='all')

           Rno  Name  Maths  Science  English
count        9     9      9        9        9
unique       9     9      7        8        8
top     111111  John     56       64       22
freq         1     1      2        2        2

In [15]:
df.memory_usage()

Index      72
Rno        72
Name       72
Maths      72
Science    72
English    72
dtype: int64

In [16]:
df['Name'].nbytes

72

In [17]:
#Accessing a Column

In [18]:
df.columns   # display all the columns availabe in df

Index(['Rno', 'Name', 'Maths', 'Science', 'English'], dtype='object')

In [20]:
df['Name']

0        John
1        Jane
2       Sarah
3       Frank
4        Mike
5    Jennifer
6     Jessica
7        Fred
8         Bob
Name: Name, dtype: object

In [21]:
df.columns[1:3]

Index(['Name', 'Maths'], dtype='object')

In [22]:
#Retrieving Rows

In [23]:
df.iloc[0]

Rno        111111
Name         John
Maths          56
Science        64
English        69
Name: 0, dtype: object

In [24]:
print(df)
df.iloc[3]

      Rno      Name Maths Science English
0  111111      John    56      64      69
1  111112      Jane    16      24      22
2  111113     Sarah    76      52       3
3  111114     Frank    75      83      80
4  111115      Mike    56       9     100
5  111116  Jennifer    73      65      74
6  111117   Jessica    16      30      77
7  111118      Fred    15      64      22
8  111119       Bob    37      36      99

Rno        111114
Name        Frank
Maths          75
Science        83
English        80
Name: 3, dtype: object

In [25]:
df.iloc[1:3]  # no.of rows

      Rno   Name Maths Science English
1  111112   Jane    16      24      22
2  111113  Sarah    76      52       3

In [26]:
df.iloc[1,3] # particular value using row and column

24

In [27]:
df.isnull().sum() # no. of zeros in each column

Rno        0
Name       0
Maths      0
Science    0
English    0
dtype: int64

In [28]:
df['Maths'].unique()   # no. of unique values in Maths column

array([56, 16, 76, 75, 73, 15, 37], dtype=object)

In [29]:
# Replace

In [30]:
print(df)
df['Maths'].replace('Absent',np.nan,inplace=True)    # To replace Absent with Null value

      Rno      Name Maths Science English
0  111111      John    56      64      69
1  111112      Jane    16      24      22
2  111113     Sarah    76      52       3
3  111114     Frank    75      83      80
4  111115      Mike    56       9     100
5  111116  Jennifer    73      65      74
6  111117   Jessica    16      30      77
7  111118      Fred    15      64      22
8  111119       Bob    37      36      99

In [31]:
df['Science'].replace('Absent',50,inplace=True)
print(df)

      Rno      Name Maths Science English
0  111111      John    56      64      69
1  111112      Jane    16      24      22
2  111113     Sarah    76      52       3
3  111114     Frank    75      83      80
4  111115      Mike    56       9     100
5  111116  Jennifer    73      65      74
6  111117   Jessica    16      30      77
7  111118      Fred    15      64      22
8  111119       Bob    37      36      99

In [32]:
#statistical measures of columns

In [33]:
df['Maths'].max()

76

In [34]:
df['Maths'].min()

15

In [35]:
df['Maths'].mean()

46.666666666666664

In [36]:
df['Maths'].median()

56.0

In [37]:
df['Maths'].mode()

0    16
1    56
dtype: object

In [38]:
df['Maths'].std()

26.239283526803856

In [39]:
df['Maths'].value_counts()    # no. of times occurance

56    2
16    2
76    1
75    1
73    1
15    1
37    1
Name: Maths, dtype: int64

In [40]:
df

      Rno      Name Maths Science English
0  111111      John    56      64      69
1  111112      Jane    16      24      22
2  111113     Sarah    76      52       3
3  111114     Frank    75      83      80
4  111115      Mike    56       9     100
5  111116  Jennifer    73      65      74
6  111117   Jessica    16      30      77
7  111118      Fred    15      64      22
8  111119       Bob    37      36      99

In [41]:
m_s=df[(df['Maths']>60) & (df['Science']>60)]  
print(m_s)

      Rno      Name Maths Science English
3  111114     Frank    75      83      80
5  111116  Jennifer    73      65      74